{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey, I'm Chatbot and If any question about RCAA ,Ask please",
        "Hello, How can I help you concerning Rwanda Civil aviation Authority",
        "Hi there, I'm here to to answer you for any question related Rwanda Civil Aviation Authority?",
        "Hi there, Tell me what you need to know About Rwanda Aviation Authority?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "address",
      "patterns": [
        "Which place is RCAA 's office?",
        "Which place is Rwanda Civil Aviation Authority 's office?",
        "Where is Rwanda Civil Aviation Authority office?",
        "Where is RCAA head office?",
        "What location of RCAA?",
        "What location of Rwanda Civil Aviation Authority?"
      ],
      "responses": [
        "RCAA office located in Kigali international Airport",
        "RCAA located at Kanombe in Kigali international Airport"
      ]
    },
    {
      "tag": "Leader",
      "patterns": [
        "Who is RCAA Head Leader?",
        "Do you know the Director of Rwanda civil aviation Authority?",
        "Who is Rwanda Civil aviation Authority Leader?",
        "what is the name of RCAA General Director?",
        "Who is in charge of Rwanda Civil Aviation Authority?"
      ],
      "responses": [
        "RCAA General Director is Silas Udahemuka",
        "The Leader of Rwanda Civil Aviation Authority is Silas Udahemuka"
      ]
    },
    {
      "tag": "time",
      "patterns": [
        "How long RCAA office is open?",
        "How long Rwanda Civil Aviation Authority office is open?",
        "What time RCAA close office doors?",
        "At which time Rwanda Civil Aviation Authority office is open?"
      ],
      "responses": [
        "Rwanda CAA office is 24 over 24 hours",
        "RCAA Services is being provvided all 24 hours"
      ]
    },
    {
      "tag": "Planes",
      "patterns": [
        "Tell me about having an Aircraft in Rwanda!",
        "Tell me something concerning registaration of plane or jet here!",
        "Do you know the requirement for the Aircraft to operate in Rwanda?"
      ],
      "responses": [
        "An aircraft shall not Operate in Rwanda unless it bears the nationality and registration marks as required by the laws and Regulations of Rwanda for registration and marking of civil aircraft"
        
      ]
    },
    {
      "tag":"RCAA",
      "patterns": [
        "Tell me more about Rwanda Civil Aviation Authority (RCAA)?",
        "Tell me in detail about RCAA?",
        "What is RCAA",
        "What to know about RCAA",
        "More information on Rwanda Civil Aviation Authority",
        "RCAA?",
        "Rwanda Civil Aviation Authority?"
      ],
      "responses": [
        "Rwanda Civil Aviation Authority (RCAA) is the national aviation authority of the Republic of Rwanda. RCAA is affiliated to the Ministry of Infrastructure and is mandated to regulate and ensure oversight of Aviation Safety, Security, Economic regulation of Air Services and development of Civil Aviation as guided by the provisions of the Convention on International Civil Aviation Organization's Standards and Recommended Practices (SARPs) "
        
      ]
    },
    {
      "tag": "Creation",
      "patterns": [
        "How old RCAA is?",
        "When did Rwanda Civil Aviation Authority created?",
        "when RCAA started?",
        "Since when RCAA offering services",
        "In which year Rwanda Civil Aviation Authority started?"
      ],
      "responses": [
        "In replacement of the Rwanda Airport Authority established in 1986, Civil Aviation Authority (CAA) was created by law No. 21/2004 of 10/08/2004 to take on the management, operation and maintenance of airport infrastructure. The law was later revised in 2006 by law no 44/2006 of 05/10/2006 forming Rwanda Civil Aviation Authority (RCAA), mandated to assume both regulatory functions and the operation of airports and the provision of Air Navigation Service (ANS)"
      ]
    },
    {
      "tag": "internship",
      "patterns": [
        "How to apply for RCAA internship?",
        "How to get internship in Rwanda Civil Aviation Authority created?",
        "Is it possible to have an internship at RCAA?",
        "Can i have an internship in RCAA",
        "Rwanda Civil Aviation Authority internship?"
      ],
      "responses": [
        "If you want to apply for an internship/graduate program send your application to hr@caa.gov.rw"
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "Give me General contact of RCAA ?",
        "Rwanda Civil Aviation Authority contact",
        "How can i reach out to the RCAA?",
        "Can i have RCAA contact",
        "Rwanda Civil Aviation Authority address?"
      ],
      "responses": [
        "You can use this Email: info@caa.gov.rw and Tel: (+250)724123151",
        "Click on this Link https://www.caa.gov.rw/contact-us to get contact"

      ]
    },
    {
      "tag": "Entities",
      "patterns": [
        "Names of regurated inteties?",
        "Campanies that allowed to oparate an Aircraft in Rwanda?",
        "Aircraft service provider in Rwanda?",
        "which regurated aircraft intities here in Rwanda?"
      ],
      "responses": [
        "Registered and regurated Aircraft inteties in Rwanda are RwandAir and Akagera Aviation",
        "RwandAir and Akagera Aviation"
      ]
    }
    ,
    {
      "tag": "UAS",
      "patterns": [
        "Which requirement of operating UAS or Drone in Rwanda?",
        "Can I fly my Drone in Rwanda?",
        "Tell me about drone registration in Rwanda?",
        "What about registring process of Drone",
        "In which year Rwanda Civil Aviation Authority started?"
      ],
      "responses": [
        "All UAS/ Drones operators in Rwanda are required to register their UAS in accordance with Rwanda UAS Regulations. The operator is required to formally apply to RCAA by submitting a formal letter entailing the UAS use case and attaching an applicant information form via info@caa.gov.rw copy UAS.SSP@caa.gov.rw . Following the response from the Authority, the applicant shall follow the procedures in the advisory circular to create a Drone Portal account and register their UAS/ Drones.",
        "You can use this link https://www.caa.gov.rw/service-details/uas-registration for more information about registration process and operating UAS in Rwanda. Thank you"
      ]
    },
    {
      "tag": "DroneCharges",
      "patterns": [
        "How much money for registring Drone?",
        "Drone fees in Rwanda?",
        "How much you been charged to operate UAS in Rwanda?",
        "Cost of registring drone?",
        "Cost of drone operator certificate?"
      ],
      "responses": [
        "All information related to the drone fees follow this link https://www.caa.gov.rw/index.php?eID=dumpFile&t=f&f=40581&token=92fc3065926b48c32a2ae6d414dfec01d189d52c",
        "Any thing concerning UAS charges Click on this link https://www.caa.gov.rw/index.php?eID=dumpFile&t=f&f=40581&token=92fc3065926b48c32a2ae6d414dfec01d189d52c"
      ]
    },
    {
      "tag": "UAS_Certification",
      "patterns": [
        "How to get Unmanned operator certificate?",
        "I want a drone oparating certificate certificate?",
        "Drone operator certificate?",
        "what can i do be certified as UAS operator?"
      ],
      "responses": [
        "For more details about getting Unmanned operator certificate Check this link https://www.caa.gov.rw/service-details/unmanned-operator-certificate",
        "Regarding Drone oparating use this link https://www.caa.gov.rw/service-details/unmanned-operator-certificate"
      ]
    },
    {
      "tag": "Piloting",
      "patterns": [
        "Names of regurated inteties?",
        "Campanies that allowed to oparate an Aircraft in Rwanda?",
        "Aircraft service provider in Rwanda?",
        "which regurated aircraft intities here in Rwanda?"
      ],
      "responses": [
        "All UAS remote pilots flying in Rwanda should have a Rwandan remote UAS Pilot Certificate that meets the requirements stipulated in Rwanda UAS Regulations. More information regarding piloting certification click on this link https://www.caa.gov.rw/service-details/uas-pilot-certificate",
        "More detail for UAS piloting in Rwanda please open the following link https://www.caa.gov.rw/service-details/uas-pilot-certificate"
      ]
    }

  ]
}
